# FabricationSystemName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationService..::..FabricationSystemName Property
FabricationService Class See Also
---
The fabrication system name of the service.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public string FabricationSystemName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FabricationSystemName As String
	Get
```

Visual C++
---
```text
public:
property String^ FabricationSystemName {
	String^ get ();
}
```

# Remarks
A fabrication system in this context is a set of buttons that can be shared across fabrication services. It has nothing to do with other MEP systems in Revit.
# See Also
FabricationService Class
Autodesk.Revit.DB Namespace